---
kind: property
id: P:Autodesk.Revit.DB.ViewSchedule.IsInternalKeynoteSchedule
zh: 明细表
source: html/148b56a4-69df-af56-78a7-4a30265e7f54.htm
---
# Autodesk.Revit.DB.ViewSchedule.IsInternalKeynoteSchedule Property

**中文**: 明细表

Identifies if this ViewSchedule is an internal schedule used when keynotes are filtered based on the elements that are shown on a sheet.

## Syntax (C#)
```csharp
public bool IsInternalKeynoteSchedule { get; }
```

## Remarks
These schedules cannot be modified by the user or placed on sheets.